#ifndef _KEYBOARD_H
#define _KEYBOARD_H

#define MAKE         0
#define BREAK        1
#define KBD_BUF_SIZE 32

#define MAP_COL      3
#define NO_SHIFT     0
#define WITH_SHIFT   1
#define BRA          3

/* 扫描码 = 数组下标 * 3 */
unsigned char keymap[] = {
  0,            0,              0,
  0,            0,              0, /* esc */
  '1',          '!',            0,
  '2',          '@',            0,
  '3',          '#',            0,
  '4',          '$',            0,
  '5',          '%',            0,
  '6',          '^',            0,
  '7',          '&',            0,
  '8',          '*',            0,
  '9',          '(',            0,
  '0',          ')',            0,
  '-',          '_',            0,
  '=',          '+',            0,
  0,            0,              0, /* backspace */
  0,            0,              0, /* tab */
  'q',          'Q',            0,
  'w',          'W',            0,
  'e',          'E',            0,
  'r',          'R',            0,
  't',          'T',            0,
  'y',          'Y',            0,
  'u',          'U',            0,
  'i',          'I',            0,
  'o',          'O',            0,
  'p',          'P',            0,
  '[',          '{',            0,
  ']',          '}',            0,
  0,            0,              0, /* enter */
  0,            0,              0, /* ctrl_l */
  'a',          'A',            0,
  's',          'S',            0,
  'd',          'D',            0,
  'f',          'F',            0,
  'g',          'G',            0,
  'h',          'H',            0,
  'j',          'J',            0,
  'k',          'K',            0,
  'l',          'L',            0,
  ';',          ':',            0,
  '\'',         '"',            0,
  '`',          '~',            0,
  0,            0,              0, /* shift_l */
  '\\',         '|',            0,
  'z',          'Z',            0,
  'x',          'X',            0,
  'c',          'C',            0,
  'v',          'V',            0,
  'b',          'B',            0,
  'n',          'N',            0,
  'm',          'M',            0,
  ',',          '<',            0,
  '.',          '>',            0,
  '/',          '?',            0,
  0,            0,              0, /* shift_r */
  '*',          '*',            0,
  0,            0,              0, /* alt_l */
  ' ',          ' ',            0,
  0,            0,              0, /* caps_lock */
};

#endif /* _KEYBOARD_H */
